%define SYS_READ    0 ; 0 - прочитать файл
%define SYS_WRITE   1 ; 1 - вывести текст на экран
%define SYS_OPEN    2 ; 2 - открыть файл
%define SYS_CLOSE   3 ; 3 - закрыть файл
%define SYS_EXIT    60 ; завершить программу

%define BUF_SIZE    65536 ; max размер файла, который можем прочитать
%define MAX_N       8192 ; max кол-во чисел, которое влезет в один массив

section .rodata ; только чтение (менять нельзя)
msg_sep         db ": "  ; разделитель для вывода ответа (2 байт)
msg_bad         db ": файл испорчен", 10 ; сообщ об ошибке (10 - символ переноса строки \n)
msg_bad_len     equ $ - msg_bad ; длина строки с ошибкой
msg_usage       db "Использование: ./average <имя_файла>", 10 ; подсказка
msg_usage_len   equ $ - msg_usage ; длина подсказки



section .data
pad             db 0 ; заглушка


section .bss
buf             resb BUF_SIZE ; бронь 64 КБ памяти под текст из файла
arr_x           resq MAX_N ; массив для чисел из первой строки (resq - 8 байт на число)
arr_y           resq MAX_N ; массив для чисел из второй строки (resq - 8 байт на число)
outbuf          resb 32 ; (32 байта) ответ для вывода на экран

; начало программы 
section .text
default rel ; использовать правильную адресацию
global _start ; точка входа

_start:
    mov     rax, [rsp] ; кол-во аргументов командной строки
    cmp     rax, 2 ; сравнение с 2 
    jl      .usage ; если <2 -> файл не передали -> печатать ошибку 
    mov     r15, [rsp + 16] ; если все ок -> (кол-во аргументов, сдвиг на 8 байт ./average, сдвиг на 16 data.txt)

    mov     eax, SYS_OPEN ; команда: "открыть файл"
    mov     rdi, r15 ; указатель, какой файл открывать (из r15)
    xor     esi, esi ; флаг O_RDONLY (только чтение). xor обнуляет регистр быстрее всех 
    xor     edx, edx ; права доступа не нужны при чтении, тоже ноль
    syscall ; выполнить то, что настроили выше
    test    rax, rax ; ответ ядра (если файл не найден -> отрицательное число)
    js      .bad ; если ответ с минусом  -> выскочит ошибка .bad
    mov     r14, rax ; ответ ядра положить в регистр r14


    xor     r13, r13; r13 - счетчик прочитанных байтов (с нуля)
.read_loop: ; цикл чтения
    mov     rdx, BUF_SIZE ; сколько памяти всего ?
    sub     rdx, r13 ; вычесть что уже занято
    jz      .bad_close ; место закончилось -> файл слишком большой -> выброс ошибки
    
    mov     eax, SYS_READ ; команда: "прочитать из файла"
    mov     rdi, r14 ; читать из файла (номер из r14)
    lea     rsi, [buf + r13] ; куда положить прочитанный текст (сдвиг на кол-во уже прочитанного)
    syscall ; звонок
    
    test    rax, rax ; сколько байт прочитано
    js      .bad_close ; отрицательное - ошибка чтения
    jz      .read_done ; 0 - файл закончился, выход из цикла
    add     r13, rax ; положительное число - плюсуем к счетчику количество прочитанных байтов
    jmp     .read_loop ; на следующий круг цикла

.read_done:
    mov     eax, SYS_CLOSE  
    mov     rdi, r14 ; номер файла переложить в rdi 
    syscall ; звонок: "закрыть файл"
    
    lea     r12, [buf] ; точка начала прочитанного текста
    lea     r13, [buf + r13]; точка r13 на конец текста

    lea     rdi, [arr_x] ; адрес первого массива (куда складывать распакованные числа)
    call    parse_line ; текст в цифры
    test    rax, rax ; проверка(кол-во чисел) 
    jle     .bad ; 0 или отриц -> файл испорчен
    mov     rbx, rax ; сохранить длину первого массива 

    lea     rdi, [arr_y] ; адрес для второго массива 
    call    parse_line ; берем вторую строчку
    cmp     rax, rbx; сравнения первого массива со вторым 
    jne     .bad  ; длины не совпадают -> файл испорчен

.trail:
    cmp     r12, r13 ; дошли до конца файлаа?
    jae     .calc; да -> переходим к вычислениям .calc
    mov     al, [r12]; один символ
    inc     r12 ; сдвиг адреса на 1
    cmp     al, ' ' ; это пробел?
    je      .trail ; игнор -> идти дпльше
    cmp     al, 9 ; это таб? 
    je      .trail ; игнор
    cmp     al, 10 ; это \n ?
    je      .trail ; игнор
    cmp     al, 13 ; это \r ?
    je      .trail  ; игнор
    jmp     .bad ; иначе -> файл испорчен

.calc:
    xor     ecx, ecx ; счетчик i = 0
    xor     esi, esi ; общая сумма разностей = 0
.sum_loop:
    mov     rax, [arr_x + rcx * 8]  ; берем число x[i] (сдвиг на 8, тк 1 число занимает 8 байт)
    sub     rax, [arr_y + rcx * 8]  ; вычитаем из него y[i]
    add     rsi, rax ; плюсуем разность к общей сумме в rsi
    inc     rcx ; i++
    cmp     rcx, rbx ; дошли до конца массива ?
    jb      .sum_loop ; нет -> повторяем цикл для следующей пары

    mov     rax, rsi ; переместить общую сумму в rax (тк деление работает только с rax)
    cqo  ; растягиваем знак числа для правильного деления с минусами
    idiv    rbx ; деление сумму на кол-во элементов
    mov     r12, rax; ответ положить в r12

    call    print_name ; Сначала печатаем имя файла
    
    ; печатать двоеточие с пробелом
    mov     eax, SYS_WRITE  
    mov     edi, 1 ; 1 - стандартный вывод
    lea     rsi, [msg_sep] ; вывести :
    mov     edx, 2 ; состоит из двух символов (разделитель и пробел)
    syscall

    mov     rax, r12 ; берем ответ
    lea     rdi, [outbuf + 31] ; ставим указатель в конец текстового буфера
    mov     byte [rdi], 10  ; туда символ перевода строки (\n)
    mov     r8, 1 ; r8 - длина строки ответа
    xor     r9d, r9d ; r9 = флаг, было число отрицательным
    
    test    rax, rax ; проверка знака ответа
    jns     .conv ; положительный - конвертировать
    neg     rax ; с минусом - делаем его полложительным
    mov     r9d, 1 ; флаг: "число с минусом"

.conv:
    mov     rcx, 10 ; делитель 10 (чтобы разделить число на отдельные цифры)

.digit:
    xor     edx, edx ; обнуляем остаток
    div     rcx ; делим на 10. (остаток наодится в dl)
    add     dl, '0' ; + к цифре код символа нуля, превращая ее в текст
    dec     rdi ; сдвиг курсора влево (число с конца)
    mov     [rdi], dl ; записываем в буфер
    inc     r8 ; длина++
    test    rax, rax; осталось еще что-то?
    jnz     .digit ; да - продолжает работать digit
    
    test    r9d, r9d ; был флаг отрицательного числа?
    jz      .print  ; нет - можно выводить
    dec     rdi ; да - сдвигаем курсор еще левее
    mov     byte [rdi], '-' ; пишем минус
    inc     r8 ; к длине + 1

.print:

    mov     rsi, rdi ; откуда начинать печатать текст
    mov     rdx, r8 ; сколько символов печатать
    mov     edi, 1 ; печать на 1 (1-экран)
    mov     eax, SYS_WRITE ; печать 
    syscall
    xor     edi, edi ; код успешного завершения (0)
    jmp     .exit ; выход


.bad_close:
    mov     eax, SYS_CLOSE ; файл испорчен, но открыт - закрыть
    mov     rdi, r14 ; что закрыть
    syscall

.bad:
    call    print_name ; напечатать имя файла
    mov     eax, SYS_WRITE  ; ": файл испорчен"
    mov     edi, 1 ; (терминал)
    lea     rsi, [msg_bad] ; текст ошибки
    mov     edx, msg_bad_len ; длина сообщ об ошибке 
    syscall
    xor     edi, edi ; обнуляем 
    jmp     .exit

.usage:
    mov     eax, SYS_WRITE  ; не передали файл -> подсказка как запустить
    mov     edi, 2 ; 2 -поток ошибок
    lea     rsi, [msg_usage] ; текст ошибки
    mov     edx, msg_usage_len ; длина сообщ
    syscall
    mov     edi, 1 ; код ошибки завершения проги 

.exit:
    mov     eax, SYS_EXIT   ; выход
    syscall



print_name:
    xor     edx, edx ; длина имени = 0
.len:
    cmp     byte [r15 + rdx], 0 ; дошли до конца имени (конец строки 0)?
    je      .write ; да - печатаем
    inc     rdx ; иначе - считаем дальше (rdx++)
    jmp     .len

.write:
    mov     rsi, r15 ; текст имени
    mov     edi, 1 ; в терминал
    mov     eax, SYS_WRITE
    syscall
    ret ; возв из функции



parse_line:
    xor     r8d, r8d ; счетчик чисел

.next_num: ; метка начала поиска след числа

.skip1: ; 
    cmp     r12, r13 ; конец файла?
    jae     .err
    mov     al, [r12] ; берем текущий символ
    cmp     al, ' ' ; это пробел?
    je      .skip1_inc ; да - сдвиг на 1 и переход к след числу 
    cmp     al, 9 ; это таб?
    jne     .sign ; нет - переход в sign

.skip1_inc:
    inc     r12 ; сдвиг на 1
    jmp     .skip1 ; возвращ искать след число

.sign: ; есть знак минус?
    xor     r9d, r9d ; флаг минуса = 0 
    cmp     al, '-' ; это минус?
    jne     .plus ; не минус - пропускаем 
    mov     r9d, 1 ; флаг минуса = 1
    inc     r12 ; сдвиг на 1
    jmp     .digits ; отправляем собирать цифры
.plus:
    cmp     al, '+' ; это +? 
    jne     .digits ; нет -> это цифра (отправлять собирать цифры) 
    inc     r12 ; сдвиг на 1 

.digits: 
    xor     eax, eax ; переменная для накопления итогового чисал
    xor     r10d, r10d ; счетчик цифр

.dig_loop:
    cmp     r12, r13 ; конец?
    jae     .dig_end ; цикл стоп
    movzx   edx, byte [r12] ; берем символ и дополняем нулями слева
    sub     edx, '0' ; переделывваем текстовый код символа в саму цифру ('5' = 5)
    cmp     edx, 9  ; это не цифра?
    ja      .dig_end ; стоп собирать число
    
    imul    rax, rax, 10  ; накопленное * 10
    add     rax, rdx ; add новую цифру (было 5, пришла 3 -> 50 + 3 = 53)
    inc     r10d  ; счетчик++
    inc     r12  ; сдвиг на 1 
    jmp     .dig_loop

.dig_end:
    test    r10d, r10d ; сколько цифр собрали   
    jz      .err ; нет цифр - ошибка, файл сломан
    test    r9d, r9d ; проверка флага знака 
    jz      .store ; минуса нет - сохраняем
    neg     rax ; минус есть - add -

.store:
    cmp     r8, MAX_N ; переполнился массив ?
    jae     .err ; да - ошибка
    mov     [rdi + r8 * 8], rax ; кладем ответ в массив
    inc     r8 ; счетчик++


.skip2:
    cmp     r12, r13 ; конец файла?
    jae     .eol ; конец
    mov     al, [r12] ; берем один файл 
    cmp     al, ' ' ; это пробел?
    je      .skip2_inc 
    cmp     al, 9 ; это таб?
    jne     .after

.skip2_inc:
    inc     r12 ; сдвиг на 1 
    jmp     .skip2

.after:
    cmp     al, ',' ; это запятая?    
    jne     .newline ; нет - это конец строки?
    inc     r12  ; это запятая - идем за след числом
    jmp     .next_num 

.newline:                   
    cmp     al, 13  ; это \r?
    je      .cr
    cmp     al, 10 ; это \n?
    jne     .err ; нет - файл испорчен
    inc     r12 ; Иначе - конец строки первой
    jmp     .eol

.cr:
    inc     r12 ; свдиг на 1
    cmp     r12, r13 ; конец файла?
    jae     .eol
    cmp     byte [r12], 10 ; это  \r\n?
    jne     .eol 
    inc     r12 ; сдвиг на 1 

.eol:
    mov     rax, r8 ; кол-во чисел в rax
    ret  ; возв в основн программу

.err:
    mov     rax, -1 ; возвращ -1
    ret